# QTCloseMovieFileN

```pascal
PROCEDURE QTCloseMovieFileN(movieRef : INTEGER);
```

```python
def vs.QTCloseMovieFileN(movieRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|movieRef|INTEGER|Index of QuickTime movie stream.|

## Examples
```pascal
QTCloseMovieFileN(1);
```
```python
import vs

movieRef = 1

vs.QTCloseMovieFileN(movieRef)
```

## Version
Availability: from Vectorworks 2018

## Category
* Special - QuickTime